/******************************************************************************

Многие исследования показывают, что улыбка способствует успеху. Напишите
программу, которая производит следующий вывод:
Улыбайся!Улыбайся!Улыбайся!
Улыбайся!Улыбайся!
Улыбайся!

*******************************************************************************/
#include <stdio.h>

void smile()
{
    printf ("Smile!");
}

int main ()
{
  for (int i = 0; i < 3; i++)
    {
      for (int j = i; j < 3; j++)
    	{
    	  smile();
    	}
    	
      printf ("\n");
    }

  return 0;
}
