/******************************************************************************

 Напишите программу, которая запрашивает имя и фамилию, а затем выводит их в формате фамилия, имя.

*******************************************************************************/
#include <stdio.h>

int main()
{   
    char name[20];
    char soname[20];
    printf("Input name & so-name");
    scanf("%s", name);
    scanf("%s", soname);
    printf("%s %s", soname, name);

    return 0;
}

