/******************************************************************************

Напишите программу, которая запрашивает у пользователя ввод значения высоты в
сантиметрах, после чего отображает высоту в сантиметрах, а также в футах и 
дюймах. Должны быть разрешены дробные части сантиметров и дюймов. Программа
должна позволить пользователю продолжать ввод значений высоты до тех пор, пока
не будет введено неположительное значение. Вывод этой программы должен иметь
следующий вид:
Введите высоту в сантиметрах: 182
182.0 см = 5 футов, 11.7 дюймов
Введите высоту в сантиметрах (<=0 для выхода из программы): 168.7
168.0 см = 5 футов, 6.4 дюймов
Введите высоту в сантиметрах (<=0 для выхода из программы): 0
Работа завершена.

*******************************************************************************/
#include <stdio.h>
double cm;
#define CM_IN_IN 0.393701
#define CM_IN_FT 0.0328084

int main ()
{
  printf ("Enter the height in centimeters: ");
  scanf ("%lf", &cm);
  while (cm > 0)
    {
      printf ("%.1lf cm = %.1lf feet, %.1lf inches\n", cm, cm * CM_IN_FT,
	      cm * CM_IN_IN);
      printf ("Enter the height in centimeters (<= O to exit the program): ");
      scanf ("%lf", &cm);
    }
  return 0;
}

