/******************************************************************************
Воспользуйтесь вложенными циклами, чтобы написать программу, которая выводит следующую последовательность символов:

$
$$
$$$
$$$$
$$$$$

*******************************************************************************/
#include <stdio.h>

int pyramids = 8;
int main ()
{
  for (int i = 0; i < pyramids; i++)
    {
      for (int j = 0; j <= i; j++)
	{
	  printf ("$");
	}
      printf ("\n");
    }
  return 0;
}
