/******************************************************************************

 Воспользуйтесь вложенными циклами, чтобы написать программу, которая выводит
 следующую последовательность символов:

F
FE
FED
FEDC
FEDCB
FEDCBA

*******************************************************************************/
#include <stdio.h>
char start_letter = 'F';
int
main ()
{
  for (int i = 0; i < 6; i++)
    {
      for (int j = 0; j <= i; j++)
	{
	  printf ("%c", start_letter - j);
	}

      printf ("\n");
}
    
}

