/******************************************************************************

Напишите программу, которая читает входные данные до тех пор, пока не 
встретится символ #. Программа должна выводить каждый введенный символ и его
десятичный код ASCII. Каждая строка вывода должна содержать восемь пар
“символ-код».

*******************************************************************************/
#include <stdio.h>

int main()
{
#include<stdio.h>

int ctr;
ctr = 0;

char ch;
int main()

{
    while((ch = getchar()) != '#') {
        printf("%4c %4d ", ch, ch);
        if (ctr % 8 ==0) {
            printf("\n");
        }
        ctr++;

    }

    
    return 0;
}
}
