/******************************************************************************

Напишите функцию  функцию, которая принимает три аргумента: символ и два целых числа.
Символ предназначен для вывода. Первое целое значение задает количество
указанных символов в строке, а второе целое число устанавливает количество
таких строк. I 1апишите программу, в которой используется эта функция.

*******************************************************************************/
#include <stdio.h>
char ch;
int x, y;
void chine(char ch, int x, int y);
int main()
{
    printf("Enter a character and two integers: ");
    while(scanf(" %c %d %d",&ch, &x, &y) == 3) {

        chine(ch, x, y);
        printf("Enter a character and two integers: ");
    }
}

void chine(char ch, int x, int y) {
    for (int i = y ; i > 0; i--) {
        for(int j = x; j > 0 ; j--) {
            putchar(ch);
        }
        putchar('\n');
    }
}

